# a = 15
# A = 20

# +-*/
# c = a + a
# d = A + a

# print(c)
# print(d)
# print(a**2)

# print(15//4)
# print(15%7) остаток от деления

#float int
# x = float(input('x='))
# y = float(input('y='))
#print(f'(x+y) x+y={x+y}')


# Задача 1

# x = int(input('x='))
# a = x // 100
# b = ((x % 100) // 10)
# c = x % 10
# print(f'Сотня  = {a} Десяток = {b} единица = {c}')
# print(f'сумма чисел = {a + b + c}')

#Задача 2

# x = 'Про'
# y = 'грам'
# c = 'мирование'
# print(f'Получается слово = {x + y + c}')

#Задача 3

# print(f'Результат операции 7 < 7 = {7 < 7}')
# print(f'Результат операции 7.1 > 7 = {7.1 > 7}')
# print(f'Результат операции 3 != 9 = {3 != 9} ')
# print(f'Результат операции 3 * 4 == 2 * 6 = {3 * 4 == 2 * 6 }')

#Задача 4

# x = int(input('Первое число = '))
# y = int(input('Второе число = '))
# if( x + y > 100 ):
#     print(f'Сумма чисел равна = {x + y}')
# else:
#     print(f'Сумма чисел больше либо равно  ста ,произведение чисел = {x * y}')